package WorkBookTask.Task_61_63_Stream.Task_62;

public enum Name {
    Александр, Алексей, Анатолий, Андрей, Антон, Аркадий, Арсений, Артём,
    Артур, Борис, Вадим, Валентин, Валерий, Василий, Виктор, Виталий, Владимир,
    Владислав, Вячеслав, Георгий, Глеб, Григорий, Даниил, Денис, Дмитрий, Евгений,
    Егор, Иван, Игорь, Илья, Кирилл, Константин, Лев, Леонид, Максим, Марк, Матвей,
    Михаил, Никита, Николай, Олег, Павел, Пётр, Роман, Руслан, Сергей, Степан, Тимур,
    Фёдор, Юрий, Ярослав
}
