
// Переделать так, чтобы выводились ВСЕ даты года(с учетом того что в разных месяцах разное количество дней)
public class Sample5 {
    public static void main(String[] arg) {
        for (int i = 1; i <= 12; i++) {
            processNumber1(i);
        }
    }
    private static void processNumber1(int month) {
        if (month > -1 && month < 10) {
            oneDigit(month);
        } else {
            if (month > -1 && month < 100) {
                twoDigit(month);
            }
        }
    }
    private static void oneDigit(int dig) {
            String январь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 1 ) {
                System.out.println(январь+ "/0" + dig + "/2021");}
            String февраль = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28";
            if (dig == 2) {
                System.out.println(февраль+ "         /0" + dig + "/2021");}
            String март = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 3) {
            System.out.println(март+ "/0" + dig + "/2021");}
            String апрель = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 ";
            if (dig == 4) {
            System.out.println(апрель+ "  /0" + dig + "/2021");}
            String май = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 5) {
                System.out.println(май+ "/0" + dig + "/2021");}
            String июнь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30   ";
            if (dig == 6) {
            System.out.println(июнь+ "/0" + dig + "/2021");}
            String июль = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 7) {
            System.out.println(июль+ "/0" + dig + "/2021");}
            String август = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 8) {
            System.out.println(август+ "/0" + dig + "/2021");}
            String сентябрь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30   ";
            if (dig == 9) {
            System.out.println(сентябрь+ "/0" + dig + "/2021");}
        }
        private static void twoDigit ( int dig){
            String октябрь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 10) {
                System.out.println(октябрь+ "/" + dig + "/2021");}
            String ноябрь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30   ";
            if (dig == 11) {
                System.out.println(ноябрь+ "/" + dig + "/2021");}
            String декабрь = "01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31";
            if (dig == 12) {
                System.out.println(декабрь+ "/" + dig + "/2021");}
        }

    }




